In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Zomato data .csv")

In [3]:
df

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
0,Jalsa,Yes,Yes,4.1/5,775,800,Buffet
1,Spice Elephant,Yes,No,4.1/5,787,800,Buffet
2,San Churro Cafe,Yes,No,3.8/5,918,800,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,300,Buffet
4,Grand Village,No,No,3.8/5,166,600,Buffet
...,...,...,...,...,...,...,...
143,Melting Melodies,No,No,3.3/5,0,100,Dining
144,New Indraprasta,No,No,3.3/5,0,150,Dining
145,Anna Kuteera,Yes,No,4.0/5,771,450,Dining
146,Darbar,No,No,3.0/5,98,800,Dining
147,Vijayalakshmi,Yes,No,3.9/5,47,200,Dining

In [4]:
df.head()

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
0,Jalsa,Yes,Yes,4.1/5,775,800,Buffet
1,Spice Elephant,Yes,No,4.1/5,787,800,Buffet
2,San Churro Cafe,Yes,No,3.8/5,918,800,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,300,Buffet
4,Grand Village,No,No,3.8/5,166,600,Buffet

In [5]:
df.head(2)

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
0,Jalsa,Yes,Yes,4.1/5,775,800,Buffet
1,Spice Elephant,Yes,No,4.1/5,787,800,Buffet

In [6]:
df.tail()

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
143,Melting Melodies,No,No,3.3/5,0,100,Dining
144,New Indraprasta,No,No,3.3/5,0,150,Dining
145,Anna Kuteera,Yes,No,4.0/5,771,450,Dining
146,Darbar,No,No,3.0/5,98,800,Dining
147,Vijayalakshmi,Yes,No,3.9/5,47,200,Dining

In [7]:
df.tail(2)

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
146,Darbar,No,No,3.0/5,98,800,Dining
147,Vijayalakshmi,Yes,No,3.9/5,47,200,Dining

In [8]:
df.sample(4)

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
10,Village Café,Yes,No,4.1/5,402,500,Cafes
16,Catch-up-ino,Yes,No,3.9/5,133,800,Cafes
45,Hotboxit,No,No,3.8/5,36,400,Dining
56,Banashankari Donne Biriyani,Yes,No,3.8/5,104,300,Dining

In [9]:
df.shape

(148, 7)

In [10]:
df.size

1036

In [11]:
df.ndim

2

In [12]:
df.describe()

             votes  approx_cost(for two people)
count   148.000000                   148.000000
mean    264.810811                   418.243243
std     653.676951                   223.085098
min       0.000000                   100.000000
25%       6.750000                   200.000000
50%      43.500000                   400.000000
75%     221.750000                   600.000000
max    4884.000000                   950.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 7 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   name                         148 non-null    object
 1   online_order                 148 non-null    object
 2   book_table                   148 non-null    object
 3   rate                         148 non-null    object
 4   votes                        148 non-null    int64
 5   approx_cost(for two people)  148 non-null    int64
 6   listed_in(type)              148 non-null    object
dtypes: int64(2), object(5)
memory usage: 8.2+ KB

In [14]:
df.columns

Index(['name', 'online_order', 'book_table', 'rate', 'votes',
       'approx_cost(for two people)', 'listed_in(type)'],
      dtype='object')

In [15]:
df.values

array([['Jalsa', 'Yes', 'Yes', ..., 775, 800, 'Buffet'],
       ['Spice Elephant', 'Yes', 'No', ..., 787, 800, 'Buffet'],
       ['San Churro Cafe', 'Yes', 'No', ..., 918, 800, 'Buffet'],
       ...,
       ['Anna Kuteera', 'Yes', 'No', ..., 771, 450, 'Dining'],
       ['Darbar', 'No', 'No', ..., 98, 800, 'Dining'],
       ['Vijayalakshmi', 'Yes', 'No', ..., 47, 200, 'Dining']],
      dtype=object)

In [16]:
df.empty

False

In [17]:
df.isnull().sum()

name                           0
online_order                   0
book_table                     0
rate                           0
votes                          0
approx_cost(for two people)    0
listed_in(type)                0
dtype: int64

In [18]:
# df.dropna() if dataframe have any null value

In [19]:
df["book_table"].value_counts()

book_table
No     140
Yes      8
Name: count, dtype: int64

In [20]:
df.loc[2:4]

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
2,San Churro Cafe,Yes,No,3.8/5,918,800,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,300,Buffet
4,Grand Village,No,No,3.8/5,166,600,Buffet

In [21]:
df.loc[2:4,["name", "online_order"]]

                    name online_order
2        San Churro Cafe          Yes
3  Addhuri Udupi Bhojana           No
4          Grand Village           No

In [22]:
df.iloc[0:5,3:6]

    rate  votes  approx_cost(for two people)
0  4.1/5    775                          800
1  4.1/5    787                          800
2  3.8/5    918                          800
3  3.7/5     88                          300
4  3.8/5    166                          600

In [23]:
df_copy = df.copy()
df_copy.head()

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
0,Jalsa,Yes,Yes,4.1/5,775,800,Buffet
1,Spice Elephant,Yes,No,4.1/5,787,800,Buffet
2,San Churro Cafe,Yes,No,3.8/5,918,800,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,300,Buffet
4,Grand Village,No,No,3.8/5,166,600,Buffet

In [24]:
sorted_df_copy = df.sort_values(by = "name")
sorted_df_copy

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
19,360 Atoms Restaurant And Cafe,Yes,No,3.1/5,13,400,Cafes
115,Aarush's Food Plaza,No,No,3.4/5,0,200,Dining
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,300,Buffet
135,Amma - Manae,No,No,3.1/5,0,400,Dining
145,Anna Kuteera,Yes,No,4.0/5,771,450,Dining
...,...,...,...,...,...,...,...
10,Village Café,Yes,No,4.1/5,402,500,Cafes
57,Wamama,Yes,Yes,4.2/5,354,800,other
116,Wood Stove,No,No,3.4/5,0,150,Dining
21,Woodee Pizza,Yes,No,3.7/5,180,500,Cafes
59,XO Belgian Waffle,Yes,No,3.7/5,17,400,Dining

In [25]:
df_copy["online_order"].value_counts()

online_order
No     90
Yes    58
Name: count, dtype: int64

In [26]:
df_copy["online_order"] = df_copy["online_order"].map({"Yes":1, "No":0})

In [27]:
df_copy["book_table"].value_counts()

book_table
No     140
Yes      8
Name: count, dtype: int64

In [28]:
df_copy["book_table"] = df_copy["book_table"].map({"Yes":1, "No":0})

In [29]:
df_copy["listed_in(type)"].value_counts()

listed_in(type)
Dining    110
Cafes      23
other       8
Buffet      7
Name: count, dtype: int64

In [30]:
df_copy["listed_in(type)"] = df_copy["listed_in(type)"].map({"Dining":1, "Cafes":2, "other":3, "Buffet":4})

In [31]:
df_copy.head()

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
0,Jalsa,1,1,4.1/5,775,800,4
1,Spice Elephant,1,0,4.1/5,787,800,4
2,San Churro Cafe,1,0,3.8/5,918,800,4
3,Addhuri Udupi Bhojana,0,0,3.7/5,88,300,4
4,Grand Village,0,0,3.8/5,166,600,4

In [32]:
df_copy["approx_cost(for two people)"] = df["approx_cost(for two people)"].add(100)
df_copy.head()

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
0,Jalsa,1,1,4.1/5,775,900,4
1,Spice Elephant,1,0,4.1/5,787,900,4
2,San Churro Cafe,1,0,3.8/5,918,900,4
3,Addhuri Udupi Bhojana,0,0,3.7/5,88,400,4
4,Grand Village,0,0,3.8/5,166,700,4

In [33]:
df_copy = df_copy.drop(columns = ["name", "rate"])
df_copy.head()

,online_order,book_table,votes,approx_cost(for two people),listed_in(type)
0,1,1,775,900,4
1,1,0,787,900,4
2,1,0,918,900,4
3,0,0,88,400,4
4,0,0,166,700,4

In [34]:
df_copy.mean()

online_order                     0.391892
book_table                       0.054054
votes                          264.810811
approx_cost(for two people)    518.243243
listed_in(type)                  1.405405
dtype: float64

In [35]:
df_copy.median()

online_order                     0.0
book_table                       0.0
votes                           43.5
approx_cost(for two people)    500.0
listed_in(type)                  1.0
dtype: float64

In [36]:
df_copy.min()

online_order                     0
book_table                       0
votes                            0
approx_cost(for two people)    200
listed_in(type)                  1
dtype: int64

In [37]:
df_copy.max()

online_order                      1
book_table                        1
votes                          4884
approx_cost(for two people)    1050
listed_in(type)                   4
dtype: int64

In [38]:
df_copy = df_copy.rename(columns = {"approx_cost(for two people)" : "approx_cost", "listed_in(type)" : "listed_in"})

In [39]:
df_copy.head()

   online_order  book_table  votes  approx_cost  listed_in
0             1           1    775          900          4
1             1           0    787          900          4
2             1           0    918          900          4
3             0           0     88          400          4
4             0           0    166          700          4